<a href="https://colab.research.google.com/github/thekishanpatel/Coding-Problems/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Import Pandas**

In [0]:
import pandas as pd
import numpy as np

# **Pandas Series**

An array w/ a named index

In [0]:
labels = ['a', 'b', 'c']
mylist = [10, 20, 30]
arry = np.array(mylist)
dic = {'a':10, 'b':20, 'c':30}

In [6]:
pd.Series(data = mylist)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data = mylist, index = labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data = arry, index = labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(data = dic)

a    10
b    20
c    30
dtype: int64

In [0]:
salesq1 = pd.Series(data = [100, 200, 250, 225, 300], index = ['USA', 'India', 'UK', 'Australia', 'Russia'])

In [12]:
salesq1

USA          100
India        200
UK           250
Australia    225
Russia       300
dtype: int64

In [0]:
salesq2 = pd.Series(data = [200, 500, 300, 250, 100], index = ['USA', 'India', 'UK', 'Australia', 'France'])

In [14]:
salesq2

USA          200
India        500
UK           300
Australia    250
France       100
dtype: int64

In [15]:
salesq2['USA'] # Can call by index label

200

In [16]:
salesq2['India']

500

In [17]:
salesq2[1] # Can also call by location

500

In [18]:
salesq1 + salesq2

Australia    475.0
France         NaN
India        700.0
Russia         NaN
UK           550.0
USA          300.0
dtype: float64

# **Pandas DataFrame**

In [0]:
cols = ['W','X','Y','Z']
idx = ['A', 'B', 'C', 'D', 'E']

In [0]:
np.random.seed(42)
data = np.random.randint(-100, 100, (5,4))

In [23]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [0]:
df = pd.DataFrame(data, index = idx, columns = cols)

In [25]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [29]:
df['W'] # Selecting a Single Column

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

In [31]:
df[['W', 'Z']] # Selecting Multiple Columns, note the double brackets

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [0]:
df['new'] = df['W'] + df['Y'] # Adding New Column

In [33]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [34]:
df.drop('new', axis = 1) # Not in-place dropping

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [0]:
df.drop('new', axis = 1, inplace=True)

In [36]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [37]:
df.loc['A'] # Selecting a Row

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [38]:
df.loc[['A', 'E']]

    W   X   Y   Z
A   2  79  -8 -86
E  30  49 -48 -99

In [39]:
df.iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [40]:
df.iloc[-1]

W    30
X    49
Y   -48
Z   -99
Name: E, dtype: int64

In [41]:
df.iloc[0:3]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

In [42]:
df.iloc[[0,4]]

    W   X   Y   Z
A   2  79  -8 -86
E  30  49 -48 -99

In [43]:
df.drop('C')

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [44]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [46]:
df.loc['A', 'W']

2

In [47]:
df.loc[['A','C'], 'W']

A    2
C    2
Name: W, dtype: int64

In [49]:
df.loc[['A','C'], ['W','Y']]

   W   Y
A  2  -8
C  2 -26

In [50]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

# **Conditional Selection**

In [51]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [52]:
df[df>0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [53]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [54]:
df['X'] > 0 # Return Boolean Series

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [55]:
df[df['X'] > 0]  # Returns a DataFrame of only True rows

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [56]:
df[df['X'] > 0]['W'] # Can perform DataFrame Operations

A     2
C     2
E    30
Name: W, dtype: int64

In [57]:
(df['W'] > 0) & (df['Y'] > 1)

A    False
B     True
C    False
D     True
E    False
dtype: bool

In [58]:
(df['W'] > 0) | (df['Y'] > 1)

A    True
B    True
C    True
D    True
E    True
dtype: bool

In [60]:
df[(df['W'] > 0) & (df['Y'] > 1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

# **Resetting Index**

In [61]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [62]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [63]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [0]:
new_ind = ['CA', 'NY', 'WY', 'OR', 'CO']

In [0]:
df['States'] = new_ind

In [66]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

In [0]:
df = df.set_index('States')

In [70]:
df

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99

In [72]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

# **DataFrame Summaries**

In [73]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int64
 1   X       5 non-null      int64
 2   Y       5 non-null      int64
 3   Z       5 non-null      int64
dtypes: int64(4)
memory usage: 200.0+ bytes

In [76]:
df.dtypes

W    int64
X    int64
Y    int64
Z    int64
dtype: object

# **Working with Missing Data**

In [0]:
df = pd.DataFrame({'A':[1, 2, np.nan, 4],
                   'B':[5, np.nan, np.nan, 8],
                   'C':[10, 20, 30, 40]})

In [78]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       2 non-null      float64
 2   C       4 non-null      int64
dtypes: float64(2), int64(1)
memory usage: 224.0 bytes

## **Dropping Values**

In [80]:
df.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [81]:
df.dropna(axis = 1)

    C
0  10
1  20
2  30
3  40

In [83]:
df.dropna(axis = 1, thresh = 2)

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [84]:
df.dropna(axis = 1, thresh = 3)

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

## **Filling In Missing Data**

In [85]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [87]:
df.fillna(value = 'FILL VALUE')

            A           B   C
0           1           5  10
1           2  FILL VALUE  20
2  FILL VALUE  FILL VALUE  30
3           4           8  40

In [88]:
df.fillna(value = 0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [0]:
df['A'] = df['A'].fillna(value = 0)

In [92]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  0.0  NaN  30
3  4.0  8.0  40

In [93]:
df['B'].fillna(df['B'].mean())

0    5.0
1    6.5
2    6.5
3    8.0
Name: B, dtype: float64

In [96]:
df.fillna(df.mean())

     A    B   C
0  1.0  5.0  10
1  2.0  6.5  20
2  0.0  6.5  30
3  4.0  8.0  40

# **GroupBy**
Split - Apply - Combine

Apply is an 'aggregation' function.

In [0]:
df = pd.read_csv('/content/Universities.csv')

In [98]:
df

                                   Sector  ... Geography
0              Private for-profit, 2-year  ...    Nevada
1    Private for-profit, less-than 2-year  ...    Nevada
2    Private for-profit, less-than 2-year  ...    Nevada
3    Private for-profit, less-than 2-year  ...    Nevada
4                 Public, 4-year or above  ...    Nevada
..                                    ...  ...       ...
202            Private for-profit, 2-year  ...    Nevada
203               Public, 4-year or above  ...    Nevada
204            Private for-profit, 2-year  ...    Nevada
205        Private not-for-profit, 2-year  ...    Nevada
206                        Public, 2-year  ...    Nevada

[207 rows x 5 columns]

In [101]:
df.groupby('Year').mean() # Only applies to numerical columns; returns a DataFrame

      Completions
Year
2012   535.078947
2013   526.150000
2014   588.809524
2015   597.250000
2016   609.860465

In [102]:
df.head(5)

                                 Sector  ... Geography
0            Private for-profit, 2-year  ...    Nevada
1  Private for-profit, less-than 2-year  ...    Nevada
2  Private for-profit, less-than 2-year  ...    Nevada
3  Private for-profit, less-than 2-year  ...    Nevada
4               Public, 4-year or above  ...    Nevada

[5 rows x 5 columns]

In [103]:
df.groupby(['Year', 'Sector']).sum() # Notice Multi-Index

                                              Completions
Year Sector
2012 Private for-profit, 2-year                      3072
     Private for-profit, 4-year or above              632
     Private for-profit, less-than 2-year            1327
     Private not-for-profit, 2-year                   665
     Private not-for-profit, 4-year or above         1059
     Public, 2-year                                  1170
     Public, 4-year or above                        12408
2013 Private for-profit, 2-year                      3053
     Private for-profit, 4-year or above              775
     Private for-profit, less-than 2-year            1281
     Private not-for-profit, 2-year                   471
     Private not-for-profit, 4-year or above         1016
     Public, 2-year                                  1633
     Public, 4-year or above                        12817
2014 Private for-profit, 2-year                      2957
     Private for-profit, 4-year or above             1506
     Private for-profit, less-than 2-year            1328
     Private not-for-profit, 2-year                   449
     Private not-for-profit, 4-year or above         1042
     Public, 2-year                                  2286
     Public, 4-year or above                        15162
2015 Private for-profit, 2-year                      3280
     Private for-profit, 4-year or above             1306
     Private for-profit, less-than 2-year            1629
     Private not-for-profit, 2-year                   425
     Private not-for-profit, 4-year or above         1228
     Public, 2-year                                  2355
     Public, 4-year or above                        16056
2016 Private for-profit, 2-year                      3286
     Private for-profit, 4-year or above              748
     Private for-profit, less-than 2-year            1552
     Private not-for-profit, 2-year                   322
     Private not-for-profit, 4-year or above         1208
     Public, 2-year                                  2431
     Public, 4-year or above                        16677

In [104]:
df.groupby('Year').describe()

     Completions
           count        mean          std   min     25%    50%     75%     max
Year
2012        38.0  535.078947  1036.433239  13.0  114.25  229.5  420.50  5388.0
2013        40.0  526.150000  1040.474782   0.0   98.50  189.0  413.00  5278.0
2014        42.0  588.809524  1150.355857   0.0  104.50  203.5  371.75  5093.0
2015        44.0  597.250000  1183.371791   0.0   87.75  191.0  405.75  5335.0
2016        43.0  609.860465  1235.952796   0.0   90.00  208.0  414.00  5367.0

In [105]:
df.groupby('Year').describe().transpose()

Year                      2012         2013  ...         2015         2016
Completions count    38.000000    40.000000  ...    44.000000    43.000000
            mean    535.078947   526.150000  ...   597.250000   609.860465
            std    1036.433239  1040.474782  ...  1183.371791  1235.952796
            min      13.000000     0.000000  ...     0.000000     0.000000
            25%     114.250000    98.500000  ...    87.750000    90.000000
            50%     229.500000   189.000000  ...   191.000000   208.000000
            75%     420.500000   413.000000  ...   405.750000   414.000000
            max    5388.000000  5278.000000  ...  5335.000000  5367.000000

[8 rows x 5 columns]

# **Pandas Operations**

In [0]:
df1 = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                    'col1':[100, 200, 300, 300, 400, 500],
                    'col2':['NY', 'CA', 'WA', 'WA', 'AK', 'NV']})

In [111]:
df1

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [112]:
df1['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [113]:
df1['col2'].nunique()

5

In [114]:
df1['col2'].value_counts()

WA    2
CA    1
NY    1
AK    1
NV    1
Name: col2, dtype: int64

In [115]:
df1.drop_duplicates() # Keeps the first occurance

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [0]:
def grab_first_letter(state):
  return state[0]

In [117]:
df1['col2'].apply(grab_first_letter)

0    N
1    C
2    W
3    W
4    A
5    N
Name: col2, dtype: object

In [0]:
df1['first_letter'] = df1['col2'].apply(grab_first_letter)

In [119]:
df1

  k1  col1 col2 first_letter
0  A   100   NY            N
1  A   200   CA            C
2  B   300   WA            W
3  B   300   WA            W
4  C   400   AK            A
5  C   500   NV            N

In [0]:
def complex_letter(state):
  if state[0] == 'W':
    return "Washington"
  else:
      return "Error"

In [0]:
df1['complex_letter'] = df1['col2'].apply(complex_letter)

In [124]:
df1

  k1  col1 col2 first_letter complex_letter
0  A   100   NY            N          Error
1  A   200   CA            C          Error
2  B   300   WA            W     Washington
3  B   300   WA            W     Washington
4  C   400   AK            A          Error
5  C   500   NV            N          Error

In [125]:
# Mapping
df1['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [0]:
my_map = {'A':1, 'B':2, 'C':3}

In [0]:
df1['num'] = df1['k1'].map(my_map)

In [129]:
df1

  k1  col1 col2 first_letter complex_letter  num
0  A   100   NY            N          Error    1
1  A   200   CA            C          Error    1
2  B   300   WA            W     Washington    2
3  B   300   WA            W     Washington    2
4  C   400   AK            A          Error    3
5  C   500   NV            N          Error    3

In [130]:
df1['col1'].max()

500

In [131]:
df1['col1'].idxmax()

5

In [132]:
df1.sort_values('first_letter')

  k1  col1 col2 first_letter complex_letter  num
4  C   400   AK            A          Error    3
1  A   200   CA            C          Error    1
0  A   100   NY            N          Error    1
5  C   500   NV            N          Error    3
2  B   300   WA            W     Washington    2
3  B   300   WA            W     Washington    2

# **Concatanate**

In [0]:
features = pd.DataFrame({'A':[100, 200, 300, 400, 500, 600],
                         'B':[12, 13, 14, 15, 16, 17]})
preds = pd.DataFrame({'preds':[0, 1, 1, 0, 1, 1]})

In [146]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16
5  600  17

In [147]:
preds

   preds
0      0
1      1
2      1
3      0
4      1
5      1

In [148]:
df2 = pd.concat([features, preds], axis = 1)
df2

     A   B  preds
0  100  12      0
1  200  13      1
2  300  14      1
3  400  15      0
4  500  16      1
5  600  17      1

In [149]:
df1['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [150]:
pd.get_dummies(df1['k1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1

In [151]:
df1

  k1  col1 col2 first_letter complex_letter  num
0  A   100   NY            N          Error    1
1  A   200   CA            C          Error    1
2  B   300   WA            W     Washington    2
3  B   300   WA            W     Washington    2
4  C   400   AK            A          Error    3
5  C   500   NV            N          Error    3

In [152]:
df2

     A   B  preds
0  100  12      0
1  200  13      1
2  300  14      1
3  400  15      0
4  500  16      1
5  600  17      1

In [0]:
df2['first_letter'] = df1['first_letter']

In [154]:
df2

     A   B  preds first_letter
0  100  12      0            N
1  200  13      1            C
2  300  14      1            W
3  400  15      0            W
4  500  16      1            A
5  600  17      1            N

In [161]:
df1

  k1  col1 col2 first_letter complex_letter  num
0  A   100   NY            N          Error    1
1  A   200   CA            C          Error    1
2  B   300   WA            W     Washington    2
3  B   300   WA            W     Washington    2
4  C   400   AK            A          Error    3
5  C   500   NV            N          Error    3

In [0]:
df1.drop([3,5], axis = 0, inplace=True)

In [0]:
df2.drop([3,5], axis = 0, inplace=True)

In [168]:
df1

  k1  col1 col2 first_letter complex_letter  num
0  A   100   NY            N          Error    1
1  A   200   CA            C          Error    1
2  B   300   WA            W     Washington    2
4  C   400   AK            A          Error    3

In [169]:
df2

     A   B  preds first_letter
0  100  12      0            N
1  200  13      1            C
2  300  14      1            W
4  500  16      1            A

In [170]:
pd.merge(df1, df2, on = 'first_letter')

  k1  col1 col2 first_letter complex_letter  num    A   B  preds
0  A   100   NY            N          Error    1  100  12      0
1  A   200   CA            C          Error    1  200  13      1
2  B   300   WA            W     Washington    2  300  14      1
3  C   400   AK            A          Error    3  500  16      1

In [171]:
df1.merge(df2, on  = 'first_letter')

  k1  col1 col2 first_letter complex_letter  num    A   B  preds
0  A   100   NY            N          Error    1  100  12      0
1  A   200   CA            C          Error    1  200  13      1
2  B   300   WA            W     Washington    2  300  14      1
3  C   400   AK            A          Error    3  500  16      1

In [0]:
years = ['1996', '1997', '1998', '1999']
df1.insert(1, column = 'Year', value = years)

In [179]:
df1

  k1  Year  col1 col2 first_letter complex_letter  num
0  A  1996   100   NY            N          Error    1
1  A  1997   200   CA            C          Error    1
2  B  1998   300   WA            W     Washington    2
4  C  1999   400   AK            A          Error    3

# **Input and Output Data**

In [181]:
!pwd

/content

In [182]:
!ls

african_econ_crises.csv  example.csv	    output.csv	 Universities.csv
bank.csv		 Excel_Sample.xlsx  sample_data

In [183]:
df1

  k1  Year  col1 col2 first_letter complex_letter  num
0  A  1996   100   NY            N          Error    1
1  A  1997   200   CA            C          Error    1
2  B  1998   300   WA            W     Washington    2
4  C  1999   400   AK            A          Error    3

In [0]:
df1.to_csv('test_output.csv', index = False)

In [0]:
df1 = pd.read_csv('test_output.csv', index_col = 'col2')

In [189]:
df1

     k1  Year  col1 first_letter complex_letter  num
col2
NY    A  1996   100            N          Error    1
CA    A  1997   200            C          Error    1
WA    B  1998   300            W     Washington    2
AK    C  1999   400            A          Error    3

In [0]:
tables = pd.read_html('https://www.espncricinfo.com/india/content/player/35320.html')

In [193]:
tables[0]

    Unnamed: 0  Mat  Inns  NO   Runs    HS  ...  100   50      4s     6s   Ct  St
0        Tests  200   329  33  15921  248*  ...   51   68     NaN   69.0  115   0
1         ODIs  463   452  41  18426  200*  ...   49   96  2016.0  195.0  140   0
2        T20Is    1     1   0     10    10  ...    0    0     2.0    0.0    1   0
3  First-class  310   490  51  25396  248*  ...   81  116     NaN    NaN  186   0
4       List A  551   538  55  21999  200*  ...   60  114     NaN    NaN  175   0
5         T20s   96    96  11   2797  100*  ...    1   16   359.0   38.0   28   0

[6 rows x 15 columns]

In [194]:
tables[1]

    Unnamed: 0  Mat   Inns  Balls  Runs  Wkts  ...    Ave  Econ     SR   4w  5w  10
0        Tests  200  145.0   4240  2492    46  ...  54.17  3.52   92.1  0.0   0   0
1         ODIs  463  270.0   8054  6850   154  ...  44.48  5.10   52.2  4.0   2   0
2        T20Is    1    1.0     15    12     1  ...  12.00  4.80   15.0  0.0   0   0
3  First-class  310    NaN   7605  4384    71  ...  61.74  3.45  107.1  NaN   0   0
4       List A  551    NaN  10230  8478   201  ...  42.17  4.97   50.8  4.0   2   0
5         T20s   96    8.0     93   123     2  ...  61.50  7.93   46.5  0.0   0   0

[6 rows x 14 columns]